
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура V1(Команда)
	ОткрытьФорму("Обработка.d3.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура V2(Команда)
	ОткрытьФорму("Обработка.d3_v2.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура V3(Команда)
	ОткрытьФорму("Обработка.d3_v3.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура V4(Команда)
	ОткрытьФорму("Обработка.d3_v4.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура Скаут(Команда)
	ОткрытьФорму("Обработка.Скаут.Форма.Форма");
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
