
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает статический снимок сцены V4 из макетов обработки.

Функция ПолучитьСнимок() Экспорт

	ОбработкаОбъект = Создать();
	Возврат ОбработкаОбъект.ПолучитьСнимок();

КонецФункции

Функция ПолучитьWebСервисEDS() Экспорт
	ПараметрыСервиса = Новый Структура;
	ПараметрыСервиса.Вставить("Сервис",Неопределено);
	ПараметрыСервиса.Вставить("КодПроверки","");
	
	Пользователь = Константы.EDSЛогин.Получить();
	Пароль = Константы.EDSПароль.Получить();
	АдресWSDL = Константы.EDSUrl.Получить();
	КодПроверки = Константы.EDSКодПроверки.Получить();
	
	Определение = Новый WSОпределения(АдресWSDL, Пользователь, Пароль, );
	
//	URIПространстваИменСервиса = "";
	URIПространстваИменСервиса = "http://fishport.ru";
	ИмяСервиса = "Eds";
	ИмяТочкиПодключения = "EdsSoap";
	
	Сервис = Новый WSПрокси(Определение, URIПространстваИменСервиса, ИмяСервиса, ИмяТочкиПодключения);
	Сервис.Пользователь = Пользователь;
	Сервис.Пароль = Пароль;
		
	ПараметрыСервиса.Сервис = Сервис;
	ПараметрыСервиса.КодПроверки = КодПроверки;
	
	Возврат ПараметрыСервиса;
КонецФункции

Функция ПолучитьWebСервисУПП() Экспорт
	ПараметрыСервиса = Новый Структура;
	ПараметрыСервиса.Вставить("Сервис", Неопределено);
	ПараметрыСервиса.Вставить("КодПроверки", "");

	Пользователь = Константы.УППЛогин.Получить();
	Пароль = Константы.УПППароль.Получить();
	АдресWSDL = Константы.УППUrl.Получить();
	КодПроверки = Константы.УППКодПроверки.Получить();

	Определение = Новый WSОпределения(АдресWSDL, Пользователь, Пароль, );

	URIПространстваИменСервиса = "http://fishport.ru";
	ИмяСервиса = "fishport";
	ИмяТочкиПодключения = "fishportSoap";

	Сервис = Новый WSПрокси(Определение, URIПространстваИменСервиса, ИмяСервиса, ИмяТочкиПодключения);
	Сервис.Пользователь = Пользователь;
	Сервис.Пароль = Пароль;

	ПараметрыСервиса.Сервис = Сервис;
	ПараметрыСервиса.КодПроверки = КодПроверки;

	Возврат ПараметрыСервиса;
КонецФункции

Функция ПолучитьWebСервисУКТ() Экспорт
	ПараметрыСервиса = Новый Структура;
	ПараметрыСервиса.Вставить("Сервис", Неопределено);
	ПараметрыСервиса.Вставить("КодПроверки", "");

	Пользователь = Константы.УКТЛогин.Получить();
	Пароль = Константы.УКТПароль.Получить();
	АдресWSDL = Константы.УКТUrl.Получить();
	КодПроверки = Константы.УКТКодПроверки.Получить();

	Определение = Новый WSОпределения(АдресWSDL, Пользователь, Пароль, );

	URIПространстваИменСервиса = "http://fishport.ru";
	ИмяСервиса = "cnt";
	ИмяТочкиПодключения = "cntSoap";

	Сервис = Новый WSПрокси(Определение, URIПространстваИменСервиса, ИмяСервиса, ИмяТочкиПодключения);
	Сервис.Пользователь = Пользователь;
	Сервис.Пароль = Пароль;

	ПараметрыСервиса.Сервис = Сервис;
	ПараметрыСервиса.КодПроверки = КодПроверки;

	Возврат ПараметрыСервиса;
КонецФункции

Функция ПолучитьWebСервисВМКТ() Экспорт
	ПараметрыСервиса = Новый Структура;
	ПараметрыСервиса.Вставить("Сервис", Неопределено);
	ПараметрыСервиса.Вставить("КодПроверки", "");

	Пользователь = Константы.ВМКТЛогин.Получить();
	Пароль = Константы.ВМКТПароль.Получить();
	АдресWSDL = Константы.ВМКТUrl.Получить();
	КодПроверки = Константы.ВМКТКодПроверки.Получить();

	Определение = Новый WSОпределения(АдресWSDL, Пользователь, Пароль, );

	URIПространстваИменСервиса = "http://fishport.ru";
	ИмяСервиса = "disp";
	ИмяТочкиПодключения = "dispSoap";

	Сервис = Новый WSПрокси(Определение, URIПространстваИменСервиса, ИмяСервиса, ИмяТочкиПодключения);
	Сервис.Пользователь = Пользователь;
	Сервис.Пароль = Пароль;

	ПараметрыСервиса.Сервис = Сервис;
	ПараметрыСервиса.КодПроверки = КодПроверки;

	Возврат ПараметрыСервиса;
КонецФункции


#КонецОбласти

#КонецЕсли
