#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает параметры подключения к внешней системе.
//
// Параметры:
//  База - СправочникСсылка.ИнформационныеБазыПорта - предопределённый элемент справочника.
//
// Возвращаемое значение:
//  Структура:
//   * АдресWSDL - Строка -
//   * ПользовательСервиса - Строка -
//   * ПарольСервиса - Строка -
//   * URIПространстваИмен - Строка -
//   * ИмяСервиса - Строка -
//   * ИмяТочкиПодключения - Строка -
//   * КодПроверки - Строка -
//   * Путь - Строка -
//   * Порт - Число -
//   * ТаймаутЗапроса - Число -
//   * ТаймаутЗапросаКарточки - Число -
//   * ИдентификаторКлиента - Строка -
Функция ПараметрыПодключения(База) Экспорт

	Параметры = НовыеПараметрыПодключения();
	Если Не ЗначениеЗаполнено(База) Тогда
		ВызватьИсключение "Не указана информационная база порта.";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИнформационныеБазыПорта.АдресWSDL КАК АдресWSDL,
		|	ИнформационныеБазыПорта.ПользовательСервиса КАК ПользовательСервиса,
		|	ИнформационныеБазыПорта.ПарольСервиса КАК ПарольСервиса,
		|	ИнформационныеБазыПорта.URIПространстваИмен КАК URIПространстваИмен,
		|	ИнформационныеБазыПорта.ИмяСервиса КАК ИмяСервиса,
		|	ИнформационныеБазыПорта.ИмяТочкиПодключения КАК ИмяТочкиПодключения,
		|	ИнформационныеБазыПорта.КодПроверки КАК КодПроверки,
		|	ИнформационныеБазыПорта.Путь КАК Путь,
		|	ИнформационныеБазыПорта.Порт КАК Порт,
		|	ИнформационныеБазыПорта.ТаймаутЗапроса КАК ТаймаутЗапроса,
		|	ИнформационныеБазыПорта.ТаймаутЗапросаКарточки КАК ТаймаутЗапросаКарточки,
		|	ИнформационныеБазыПорта.ИдентификаторКлиента КАК ИдентификаторКлиента
		|ИЗ
		|	Справочник.ИнформационныеБазыПорта КАК ИнформационныеБазыПорта
		|ГДЕ
		|	ИнформационныеБазыПорта.Ссылка = &База";
	Запрос.УстановитьПараметр("База", База);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение СтрШаблон(
			"Не найден элемент справочника ""Информационные базы порта"": %1.",
			База);
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Параметры, Выборка);

	Возврат Параметры;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеПараметрыПодключения()

	Параметры = Новый Структура;
	Параметры.Вставить("АдресWSDL", "");
	Параметры.Вставить("ПользовательСервиса", "");
	Параметры.Вставить("ПарольСервиса", "");
	Параметры.Вставить("URIПространстваИмен", "");
	Параметры.Вставить("ИмяСервиса", "");
	Параметры.Вставить("ИмяТочкиПодключения", "");
	Параметры.Вставить("КодПроверки", "");
	Параметры.Вставить("Путь", "");
	Параметры.Вставить("Порт", 0);
	Параметры.Вставить("ТаймаутЗапроса", 0);
	Параметры.Вставить("ТаймаутЗапросаКарточки", 0);
	Параметры.Вставить("ИдентификаторКлиента", "");

	Возврат Параметры;

КонецФункции

#КонецОбласти

#КонецЕсли
